Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱོད་ཀྱང་། དེ་ལ་མི་རྟོག་ཅིང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་བསྒོམ་པའི་ཚེ། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་འདི་དག་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སོ།
en: That is to say, when cultivating the eighteen distinct qualities of the buddhas [and so forth], on account of the emptiness of inherent existence, they do not think in terms of the threefold interaction, ‘These are the distinct qualities of the buddhas.

source: །བདག་གིས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་བསྒོམ་པར་བྱའོ།
en: I should cultivate the distinct qualities of the buddhas.

source: །འདིའི་དོན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་བསྒོམ་མོ་ཞེས་གསུམ་པོ་དེ་དག་ལ་མི་རྟོག་པ་སྟེ།
en: The distinct qualities of the buddhas should be cultivated with respect to that.’

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་གང་གིས་བདག་ཀྱང་འཁོར་བ་ལས་སྒྲོལ་ཞིང་གཞན་ཡང་སྒྲོལ་བ་འདི་ནི་ལམ་གྱི་ཡན་ལག་དགེ་བའི་ཆོས་སོ།
en: These distinct qualities of the buddhas [and so forth], through which they liberate themselves from cyclic existence and also liberate others, are virtuous attributes included among the aspects of the path. “

source: །རབ་འབྱོར་དགེ་བའི་ཆོས་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ལམ་སྟེ་ལམ་དེས་འདས་པ་དང་།
en: Subhūti, these virtuous attributes constitute the path of unsurpassed, complete enlightenment that bodhisattva great beings have.

source: མ་འོངས་པ་དང་ད་ལྟར་གྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སེམས་ཅན་ཚད་མེད་པ་རྣམས་དེད་དེ། འཁོར་བའི་རྒྱ་མཚོ་ལས་རྒལ་བར་གྱུར་པ་དང་རྒལ་བ་དང་། རྒལ་བར་འགྱུར་བ་སྟེ།
en: Through that path, bodhisattva great beings of the past, the future, and the present, steering with them immeasurable beings, have crossed beyond, are crossing beyond, and will cross beyond the ocean of cyclic existence.

source: ལམ་དེ་ཡོངས་སུ་རྫོགས་པར་བྱས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་དོ།
en: Having perfected that path, bodhisattva great beings attain all-aspect omniscience.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱས་ནས་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་རོ། །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏེ། སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ།
en: Having attained all-aspect omniscience, they turn the wheel of the Dharma and will turn the wheel of the Dharma, acting for the benefit of beings.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་དྲུག་ཅུ་བདུན་པའོ།། །།
en: This completes the sixty-seventh chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ལགས་ན།
en: Chapter 68 Then the venerable Subhūti asked the Blessed One, “Blessed Lord, if these attributes are the attributes of a bodhisattva, what are the attributes of a buddha?” “

source: སངས་རྒྱས་ཀྱི་ཆོས་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གང་འདི་སྐད་དུ་གལ་ཏེ་ཆོས་དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཡིན་ན། སངས་རྒྱས་ཀྱི་ཆོས་གང་ཡིན་ཞེས་ཟེར་བ་ནི།
en: Subhūti,” replied the Blessed One, “you ask, ‘If these attributes are the attributes of a bodhisattva, what are the attributes of a buddha?’

source: རབ་འབྱོར་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་ཆོས་དེ་དག་ཉིད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཟད་དེ་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་ནས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་ངོ་།
en: Subhūti, the attributes of a buddha {Ki.VIII: 141} are the very same attributes once consummate buddhahood has been attained in all respects. They then attain all-aspect omniscience and abandon all the connecting propensities.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: With regard to this [distinction], bodhisattva great beings will attain consummate buddhahood.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་ཆོས་ཐམས་ཅད་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པས།
en: The tathāgatas, arhats, completely awakened buddhas have attained consummate buddhahood with respect to all phenomena through the wisdom of a single instant, for which reason they are styled tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཁྱད་པར་དེ་ཡོད་དོ།
en: That is the distinction between bodhisattva great beings and the tathāgatas, arhats, completely awakened buddhas. “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། ཞུགས་པ་ཡང་གཞན་ལ། འབྲས་བུ་ལ་གནས་པ་ཡང་གཞན་ཏེ། དེ་གཉིས་ཀ་ཡང་འཕགས་པའི་གང་ཟག་མ་ཡིན་ཞེས་མི་བྱའོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བར་ཆད་མེད་པའི་ལམ་དུ་ཞུགས་པ་ཡིན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་བརྙེས་པ་སྟེ།
en: Subhūti, just as those entering [the fruits] are of one type and those established in the fruits are of another type, and yet these two types are not said to denote ‘unholy individuals,’ in the same way, Subhūti, bodhisattva great beings are those entering the unimpeded path and the tathāgatas, arhats, completely awakened buddhas are those who have acquired wisdom that is unobscured with respect to all phenomena.

source: རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཁྱད་པར་རོ།
en: That, Subhūti, is the distinction between bodhisattva great beings and the tathāgatas, arhats, completely awakened buddhas.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ལགས་ན་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཆོས་དེ་དག་ལ་འདི་ནི་སེམས་ཅན་དམྱལ་བ་པའོ།
en: Subhūti then asked, “Blessed Lord, if all phenomena are empty of intrinsic defining characteristics, how can one make distinctions and differentiate between these phenomena that are empty of intrinsic defining characteristics, saying, ‘This is a denizen of the hells.

source: །འདི་ནི་མིའོ་འདི་ནི་རིགས་ཀྱི་སའོ།
en: This one is a human being. This one is on the level of the spiritual family.

source: །འདི་ནི་བརྒྱད་པའོ་འདི་ནི་རྒྱུན་དུ་ཞུགས་པའོ།
en: This one is on the eighth-lowest level. This one has entered the stream to nirvāṇa.

source: །འདི་ནི་རང་སངས་རྒྱས་སོ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའོ།
en: This one is a pratyekabuddha. This one is a bodhisattva.

source: །འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སོ་ཞེས་བགྱི་བར་ཁྱད་པར་དང་རྣམ་པར་དབྱེ་བར་ཇི་ལྟར་འགྱུར།
en: This one is a tathāgata, arhat, completely awakened buddha.’

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་གང་ཟག་དེ་དག་དམིགས་སུ་མ་མཆིས་པ་དེ་བཞིན་དུ་ལས་ཀྱང་དམིགས་སུ་མ་མཆིས།
en: Blessed Lord, just as individual persons cannot be apprehended, in the same way their karma also cannot be apprehended.

source: ལས་ཇི་ལྟར་དམིགས་སུ་མ་མཆིས་པ་དེ་བཞིན་དུ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཡང་དམིགས་སུ་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Just as their karma cannot be apprehended, in the same way the maturation of their karma also cannot be apprehended.” “

source: ཇི་སྐད་དུ་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: It is as you have said.

source: ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ལ་ལས་དང་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མི་དམིགས་སོ།
en: No karma or maturation of karma can be apprehended with respect to all phenomena that are empty of intrinsic defining characteristics.

source: །རབ་འབྱོར་གང་གིས་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཆོས་ཐམས་ཅད་དེ་ལྟར་མ་ཤེས་པ་དེ་དག་ནི་ངན་པར་སྤྱོད་པ་འམ། ལེགས་པར་སྤྱད་པ་འམ།
en: On the other hand, Subhūti, those who do not know that all phenomena are empty of intrinsic defining characteristics do condition karma, whether based on negative conduct or positive conduct, or whether it is neutral.

source: མི་གཡོ་བའི་ལས་མངོན་པར་འདུ་བྱེད་དེ། དེ་དག་ངན་པར་སྤྱད་པའི་ལས་ཀྱིས་ངན་སོང་གསུམ་དུ་ལྷུང་ངོ་།
en: Through karma based on negative conduct they regress into the three inferior realms.

source: །ལེགས་པར་སྤྱད་པའི་ལས་ཀྱིས་ལྷ་དང་མིར་སྐྱེའོ།
en: Through karma based on positive conduct they are born as gods and as human beings.

source: །ཉམས་པ་མེད་པའི་ལས་ཀྱིས་གཟུགས་ཀྱི་ཁམས་སམ། གཟུགས་མེད་པའི་ཁམས་སུ་སྐྱེའོ།
en: Through karma that is without degeneration, they are born in the realm of form or the realm of formlessness. “

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད། ནང་སྟོང་པ་ཉིད་ལ་སྤྱད། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱད། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་སྤྱད། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱད། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་དང་།
en: In this regard, bodhisattva great beings develop the path of enlightenment through conduct that is without degeneration while practicing the perfection of generosity; while practicing the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom; while practicing the emptiness of internal phenomena; {Ki.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་སྤྱད། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱད་ཏེ།
en: VIII: 142} while practicing [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity; while practicing the applications of mindfulness; while practicing the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path; while practicing the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways; and while practicing the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: ཉམས་པ་མེད་པའི་སྤྱོད་པས་བྱང་ཆུབ་ཀྱི་ལམ་བསྐྱེད་ནས། རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་འཁོར་དང་ལྡན་པ་ལ་མཉམ་པར་གཞག་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: They then become absorbed in the vajra-like meditative stability, attended by the retinue of the branches of enlightenment, and they attain consummate buddhahood in unsurpassed, complete enlightenment.

source: མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དེ།
en: Having attained consummate buddhahood, they act for the benefit of beings.

source: དོན་བྱས་ནས་ཅི་ནས་ཀྱང་ཕྱིས་ཆུད་མ་ཟོས་ཤིང་རྒྱུད་ལྔའི་འཁོར་བར་མི་ལྟུང་བ་དེ་ལྟར་དོན་བྱེད་དོ།
en: Having acted for their benefit, they in no way neglect them in the future. Acting in that manner they do not regress into cyclic existence with its five classes of living beings.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས་བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རྒྱུད་ལྔའི་འཁོར་བ་གཟིགས་སམ།
en: Blessed Lord, does the Blessed Lord see cyclic existence with its five classes of living beings, having attained consummate buddhahood in unsurpassed, complete enlightenment?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་མ་ཡིན་ནོ། །གསོལ་པ།
en: No, Subhūti,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། དེ་བཞིན་གཤེགས་པས་ཆོས་ནག་པོ་འམ། དཀར་པོ་འམ། གནག་པ་འམ། དཀར་བ་འམ།
en: Blessed Lord, do the tathāgatas apprehend phenomena that are negative, phenomena that are positive, phenomena that may be negative or positive, and phenomena that are neither negative nor positive?” “

source: མི་གནག་མི་དཀར་བ་དམིགས་ལགས་སམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: No, Subhūti,” replied the Blessed One. “

source: མ་ཡིན་ནོ། །གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་སྟེ་མ་དམིགས་ན། སེམས་ཅན་དམྱལ་བ་འམ། བྱོལ་སོང་གི་སྐྱེ་གནས་སམ། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ཇི་ལྟར་གདགས་པ་མཛད།
en: Blessed Lord, if these are not apprehended, how do beings conceive of the hells, the animal realm, or the world of Yama?

source: ལྷ་དང་མིར་ཇི་ལྟར་གདགས་པ་མཛད།
en: How do they conceive of gods and human beings?

source: རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་སུ་ཇི་ལྟར་གདགས་པ་མཛད།
en: How do they conceive of individuals entering the stream to nirvāṇa, individuals destined for only one more rebirth, individuals no longer subject to rebirth, arhats, and pratyekabuddhas?

source: བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་ཇི་ལྟར་གདགས་པ་མཛད།
en: How do they conceive of bodhisattvas and tathāgatas, arhats, completely awakened buddhas?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཅི་སེམས་ཅན་འདི་དག་ཆོས་རྣམས་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་ཤེས་སམ།
en: Subhūti, do these beings know that phenomena are empty of intrinsic defining characteristics?”

source: གསོལ་པ་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: asked the Blessed One. “No, they do not!” “

source: རབ་འབྱོར་གལ་ཏེ་སེམས་ཅན་དེ་དག་འདི་ལྟར་ཆོས་རྣམས་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཤེས་ན་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མི་འཇུག་སྟེ།
en: Subhūti,” continued the Blessed One, “if those beings knew that phenomena are empty of intrinsic defining characteristics, bodhisattva great beings would indeed not set out for unsurpassed, complete enlightenment.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མ་ཞུགས་ན། སེམས་ཅན་རྣམས་ཀྱང་ངན་སོང་གསུམ་དང་། འཁོར་བའི་རྒྱུད་རྣམས་ནས་མི་འགྲོལ་ཏེ།
en: If they did not set out for unsurpassed, complete enlightenment, they would not liberate beings from the three inferior realms and from the other classes of beings within cyclic existence.

source: རབ་འབྱོར་སེམས་ཅན་དེ་དག་ཆོས་རྣམས་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་མི་ཤེས་ལ་མི་ཤེས་པས་རྒྱུད་ལྔའི་འཁོར་བ་ལས་ཡོངས་སུ་མི་འགྲོལ་བས།
en: Subhūti, it is because {Ki.VIII: 143} beings do not know that phenomena are empty of intrinsic defining characteristics that they are not liberated from cyclic existence with its five classes of beings.

source: དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལས་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་ཐོས་ནས་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འཇུག་སྟེ།
en: For this reason, bodhisattva great beings hear from those lord buddhas that all phenomena are empty of intrinsic defining characteristics, and set out for unsurpassed, complete enlightenment for the sake of beings.

source: ཆོས་འདི་དག་ནི་ཇི་ལྟར་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་མངོན་པར་ཆགས་པར་བྱ་བ་དེ་ལྟར་ཡོད་པ་མ་ཡིན་ན།
en: These phenomena do not exist in the manner in which ordinary, simple persons are fixated on them.

source: དེ་དག་ནི་མེད་ཅིང་ཡང་དག་པ་མ་ཡིན་པའི་ཆོས་རྣམས་ལ་ཡོད་པར་བཏགས་ཤིང་། སེམས་ཅན་མེད་པ་ལ་སེམས་ཅན་དུ་འདུ་ཤེས།
en: So it is that they imagine nonexistent and inauthentic phenomena to exist, and they perceive nonexistent beings as beings.

source: གཟུགས་མེད་པ་ལ་གཟུགས་སུ་འདུ་ཤེས།
en: They perceive nonexistent physical forms as physical forms.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མེད་པ་ལ་རྣམ་པར་ཤེས་པར་འདུ་ཤེས།
en: They perceive nonexistent feelings, perceptions, formative predispositions, and consciousness as consciousness [and so forth].

source: སྐྱེ་མཆེད་རྣམས་མེད་པ་ལ་སྐྱེ་མཆེད་དུ་འདུ་ཤེས།
en: They perceive nonexistent sense fields as sense fields.

source: ཁམས་རྣམས་མེད་པ་ལ་ཁམས་སུ་འདུ་ཤེས།
en: They perceive nonexistent sensory elements as sensory elements.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྣམས་མེད་པ་ལ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བར་འདུ་ཤེས།
en: They perceive nonexistent links of dependent origination as links of dependent origination.

source: འཇིག་རྟེན་པའི་ཆོས་མེད་པ་ལ། འཇིག་རྟེན་པའི་ཆོས་སུ་འདུ་ཤེས།
en: They perceive nonexistent mundane phenomena as mundane phenomena.

source: འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་མེད་པ་ལ། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་སུ་འདུ་ཤེས།
en: They perceive nonexistent supramundane phenomena as supramundane phenomena.

source: ཟག་པ་དང་བཅས་པའི་ཆོས་མེད་པ་ལ། ཟག་པ་དང་བཅས་པའི་ཆོས་སུ་འདུ་ཤེས།
en: They perceive nonexistent contaminated phenomena as contaminated phenomena.

source: ཟག་པ་མེད་པའི་ཆོས་མེད་པ་ལ། ཟག་པ་མེད་པའི་ཆོས་སུ་འདུ་ཤེས།
en: They perceive nonexistent uncontaminated phenomena as uncontaminated phenomena.

source: འདུས་བྱས་ཀྱི་ཆོས་མེད་པ་ལ། འདུས་བྱས་ཀྱི་ཆོས་སུ་འདུ་ཤེས། འདུས་མ་བྱས་ཀྱི་ཆོས་མེད་པ་ལ། འདུས་མ་བྱས་ཀྱི་ཆོས་སུ་འདུ་ཤེས་ནས།
en: They perceive nonexistent conditioned phenomena as conditioned phenomena, and they perceive nonexistent unconditioned phenomena as unconditioned phenomena.

source: ཡོད་པ་མ་ཡིན་པའི་ཕྱིན་ཅི་ལོག་གིས། ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པའི་སེམས་དང་ལྡན་པ་རྣམས་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་མངོན་པར་འདུ་བྱེད་པ་དེ་དག་རྒྱུད་ལྔའི་འཁོར་བ་ལས་ཡོངས་སུ་མི་འགྲོལ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པར་དགེ་བའི་ཆོས་ཐམས་ཅད་འདུས་པར་བྱས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་ཅིང་།
en: With minds that are mistaken due to misconception concerning nonexistents, they effect the conditioning of body, speech, and mind. Since these persons are not liberated from cyclic existence with its five classes of beings, bodhisattva great beings engage in the conduct of a bodhisattva, integrating all virtuous attributes in the perfection of wisdom, and they will attain consummate buddhahood in unsurpassed, complete enlightenment.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རྒྱུད་ལྔའི་འཁོར་བ་ལས་སེམས་ཅན་རྣམས་ཡོངས་སུ་འགྲེལ་ཏོ།
en: Having attained consummate buddhahood, they will then liberate beings from cyclic existence with its five classes of beings.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། གལ་ཏེ་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ལགས་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། རྒྱུད་ལྔའི་འཁོར་བ་ལས་སེམས་ཅན་རྣམས་ཡོངས་སུ་འགྲེལ་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Subhūti then asked, “If all phenomena are empty of intrinsic defining characteristics, how do bodhisattva great beings, having attained consummate buddhahood in unsurpassed, complete enlightenment, liberate beings from cyclic existence with its five classes of beings?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོལ་བའི་ལམ་སེམས་ཅན་རྣམས་ལ་སྟོན་ཏོ། །འཆད་དོ། །འཇོག་གོ །འགོད་དོ།
en: In this regard, Subhūti,” replied the Blessed One, “having attained consummate buddhahood in unsurpassed, complete enlightenment, bodhisattva great beings teach to beings the [nature of] suffering, the origin of suffering, the cessation of suffering, and the path that leads to the cessation of suffering, explaining, determining, establishing, interpreting, commenting upon, elucidating, and correctly describing these [four truths of the noble ones].

source: །འགྲེལ་ཏོ། །རྣམ་པར་འགྲེལ་ཏོ། །གསལ་བར་བྱེད་དོ། །ཡང་དག་པར་རྗོད་དོ། །འཕགས་པའི་བདེན་པ་བཞི་པོ་འདིར་དགེ་བའི་ཆོས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་གང་ཇི་སྙེད་པ་གང་གིས་དཀོན་མཆོག་གསུམ་རྣམ་པར་དགོད་པ་དེ་ཐམས་ཅད་ཡོངས་སུ་འདུས་ཏེ།
en: In these four truths of the noble ones are included all the virtuous attributes and factors conducive to enlightenment through which the Three Precious Jewels are established.

source: སངས་རྒྱས་དཀོན་མཆོག་དང་། ཆོས་དཀོན་མཆོག་དང་། དགེ་འདུན་དཀོན་མཆོག་གསུམ་འཇིག་རྟེན་དུ་བྱུང་བས། སེམས་ཅན་རྣམས་ལམ་རྒྱུད་ལྔའི་འཁོར་བ་ལས་ཡོངས་སུ་འགྲོལ་ལོ།
en: That is to say, through the appearance in the world of the precious jewel of the Buddha, the precious jewel of the Dharma, and the precious jewel of the Saṅgha, beings are liberated from cyclic existence with its five classes of beings.” “

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་སྡུག་བསྔལ་འཚལ་བས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རམ། འོན་ཏེ་སྡུག་བསྔལ་གྱིས་མྱ་ངན་ལས་འདའ་བར་འགྱུར། ཀུན་འབྱུང་བ་འཚལ་བས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རམ། འོན་ཏེ་ཀུན་འབྱུང་བས་མྱ་ངན་ལས་འདའ་བར་འགྱུར།
en: Blessed Lord, do they pass into final nirvāṇa through the cognition of suffering or do they pass into final nirvāṇa through suffering?

source: སྡུག་བསྔལ་འགོག་པ་འཚལ་བས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རམ།
en: Do they pass into final nirvāṇa through the cognition of the origin of suffering or do they pass into final nirvāṇa through the origin of suffering? {Ki.

source: འོན་ཏེ་སྡུག་བསྔལ་འགོག་པས་མྱ་ངན་ལས་འདའ་བར་འགྱུར།
en: VIII: 144} Do they pass into final nirvāṇa through the cognition of the cessation of suffering or do they pass into final nirvāṇa through the cessation of suffering?

source: ལམ་འཚལ་བས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རམ། འོན་ཏེ་ལམ་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར།
en: Do they pass into final nirvāṇa through the cognition of the path or do they pass into final nirvāṇa through the path?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་སྡུག་བསྔལ་ཤེས་པས་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་སྟེ།
en: Subhūti,” replied the Blessed One, “they do not pass into final nirvāṇa through the cognition of suffering, nor do they through suffering.

source: སྡུག་བསྔལ་གྱིས་ཀྱང་མ་ཡིན་ནོ། །ཀུན་འབྱུང་བ་ཤེས་པས་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་སྟེ། ཀུན་འབྱུང་བས་ཀྱང་མ་ཡིན་ནོ།
en: They do not pass into final nirvāṇa through the cognition of the origin of suffering, nor do they through the origin of suffering.

source: །སྡུག་བསྔལ་འགོག་པ་ཤེས་པས་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་སྟེ། སྡུག་བསྔལ་འགོག་པས་ཀྱང་མ་ཡིན་ནོ།
en: They do not pass into final nirvāṇa through the cognition of the cessation of suffering, nor do they through the cessation of suffering.

source: །ལམ་ཤེས་པས་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་སྟེ། ལམ་གྱིས་ཀྱང་མ་ཡིན་ནོ།
en: They do not pass into final nirvāṇa through the cognition of the path, nor do they through the path.

source: །རབ་འབྱོར་འཕགས་པའི་བདེན་པ་བཞི་པོ་དེ་དག་མཉམ་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་མྱ་ངན་ལས་འདའ་བར་ངས་གསུངས་ཏེ།
en: Subhūti, I have said that the sameness of these four truths of the noble ones is nirvāṇa.

source: སྡུག་བསྔལ་ཤེས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མ་ཡིན།
en: That is to say, they do not pass into final nirvāṇa through the cognition of suffering, nor do they through suffering.

source: སྡུག་བསྔལ་གྱིས་ཀྱང་མ་ཡིན་ནོ། །ཀུན་འབྱུང་བ་ཤེས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མ་ཡིན། ཀུན་འབྱུང་བས་ཀྱང་མ་ཡིན་ནོ།
en: They do not pass into final nirvāṇa through the cognition of the origin of suffering, nor do they through the origin of suffering.

source: །སྡུག་བསྔལ་འགོག་པ་ཤེས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མ་ཡིན། སྡུག་བསྔལ་འགོག་པས་ཀྱང་མ་ཡིན་ནོ།
en: They do not pass into final nirvāṇa through the cognition of the cessation of suffering, nor do they through the cessation of suffering.

source: །ལམ་ཤེས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མ་ཡིན། ལམ་གྱིས་ཀྱང་མ་ཡིན་ནོ། །གསོལ་པ།
en: They do not pass into final nirvāṇa through the cognition of the path, nor do they through the path.” “

source: བཅོམ་ལྡན་འདས་གང་ལ་སྡུག་བསྔལ་ཡང་མ་མཆིས། སྡུག་བསྔལ་འཚལ་བ་ཡང་མ་མཆིས། ཀུན་འབྱུང་བ་ཡང་མ་མཆིས། ཀུན་འབྱུང་བ་འཚལ་བ་ཡང་མ་མཆིས། འགོག་པ་ཡང་མ་མཆིས། འགོག་པ་འཚལ་བ་ཡང་མ་མཆིས། ལམ་ཡང་མ་མཆིས། ལམ་འཚལ་བ་ཡང་མ་མཆིས་པའི་འཕགས་པའི་བདེན་པ་བཞི་མཉམ་པ་ཉིད་ཅེས་བགྱི་བ་དེ་དག་གང་ལགས།
en: Blessed Lord, what then is the sameness of the four truths of the noble ones, in which there is neither suffering nor the cognition of suffering, neither the origin of suffering nor the cognition of the origin of suffering, neither the cessation of suffering nor the cognition of the cessation of suffering, and neither the path nor the cognition of the path?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་ནི་འཕགས་པའི་བདེན་པ་བཞི་པོ་དེ་དག་གི་དེ་བཞིན་ཉིད་དང་།
en: That is the real nature of these four truths of the noble ones,” replied the Blessed One. “
